---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType.ShowPredefined
enum: Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType
source: html/a5e5adae-1c91-3d7b-fb6d-b0c270c70d3c.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDiagramTextLabelType.ShowPredefined

Show diagram text label only for points that have flag ValueAtPointFlags::DisplayText